#+SETUPFILE: https://portail.dti.crosemont.quebec/org-html-themes/org/theme-readtheorg.setup
#+TITLE: API Progression
#+PROPERTY: header-args:sh :results output
#+PROPERTY: header-args:sh :exports both

** Connexion en tant qu'utilisateur ~bob~ :


#+BEGIN_SRC sh :eval :results output
PASSWORD=$(cat ~/mot_de_passe)
curl https://progression.dti.crosemont.quebec/api/v1/auth --data "username=bob&password=$PASSWORD" 
#+END_SRC

#+RESULTS:
: eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJ1c2VyIjp7InVzZXJuYW1lIjoicGxhZnJhbmNlIiwicm9sZSI6MCwiaWQiOjEsImFjdGlmIjpudWxsfSwiY3VycmVudCI6MTYxMjc1NDczOCwiZXhwaXJlZCI6MTYxMjg0MTEzOH0.fOzl57wzxQh1HmAClHDzGJo4dLcMZfOxmqW9bGHlAP8

** Obtenir le profil de l'utilisateur connecté ~bob~ : 

#+BEGIN_SRC sh :var TOKEN=get_token :results output
curl https://progression.dti.crosemont.quebec/api/v1/user -H "Authorization: Bearer $TOKEN"
#+END_SRC

#+RESULTS:
#+begin_example
<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML 2.0//EN">
<html><head>
<title>400 Bad Request</title>
</head><body>
<h1>Bad Request</h1>
<p>Your browser sent a request that this server could not understand.<br />
</p>
<hr>
<address>Apache/2.4.25 (Debian) Server at ic.dti.crosemont.quebec Port 443</address>
</body></html>
#+end_example

